IDEA Open Model
ResultOfNLAPoint2 Class
Compatible with IDEA StatiCa 20.1
Note: This API is now obsolete.
 Result of internal forces in the one position
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Result.ResultOfNLAPoint2
 Namespace: IdeaRS.OpenModel.Result
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
[ObsoleteAttribute]
public class ResultOfNLAPoint2
<ObsoleteAttribute>
Public Class ResultOfNLAPoint2
The ResultOfNLAPoint2 type exposes the following members.
Constructors
Name | Description
ResultOfNLAPoint2
 Constructor
Top
Properties
Name | Description
Id
 Id of point
ResultOfIncrements
 Results in load case
X
 X coordinates on cross-section
Y
 Y coordinates on cross-section
Top
See Also
Reference
IdeaRS.OpenModel.Result Namespace